---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SiteFailures.SurfaceTriangulationFailed
source: html/5cd014e3-447e-c847-98f0-5b177e65efca.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SiteFailures.SurfaceTriangulationFailed Property

The Site Surface failed to triangulate.

## Syntax (C#)
```csharp
public static FailureDefinitionId SurfaceTriangulationFailed { get; }
```